#include <stdio.h>

int main() {
   
    
    int age;
    
    printf("Сколько тебе лет? ");
    scanf("%d", &age);
    
    if (age >= 18) {
        printf("Ты совершеннолетняя! 🎉\n");
    } else {
        printf("Ещё есть время повеселиться до взрослой жизни 😊\n");
    }
    
    
    int temp;
    
    printf("\nКакая сегодня температура на улице? ");
    scanf("%d", &temp);
    
    if (temp < 0) {
        printf("Мороз! Одевайся как капуста 🧣🧤\n");
    } else if (temp < 10) {
        printf("Холодно, куртка обязательна 🧥\n");
    } else if (temp < 20) {
        printf("Прохладно, лучше надеть кофту ☁️\n");
    } else {
        printf("Тепло! Можно гулять в футболке 🌞\n");
    }
    
    return 0;
}
